#####################
### Mon syllables ###
#####################
monindependentvowels = ["ဣ", "ဣဳ", "ဥ", "ဥု", "ဨ", "အဲ", "ဩ", "အဴ", "အံ", "အး"]
monconsonants = ["က", "ခ", "ဂ", "ဃ", "ၚ", "စ", "ဆ", "ဇ", "ၛ", "ည", "ဋ", "ဌ", "ဍ", "ဎ", "ဏ", "တ", "ထ", "ဒ", "ဓ", "န", "ပ", "ဖ", "ဗ", "ဘ", "မ", "ယ", "ရ", "လ", "ဝ", "သ", "ဟ", "ဠ", "ၜ", "အ", "ၝ"]
# monmedials = ["ျ","ြ","ွ","ႂ","ှ", "ၞ", "ၟ", "ၠ", "္ၜ", "္ၚ", "္ဉ", "္ည", "္ဍ"]
monconjuncts = ["က္က", "က္ခ", "က္ၚ", "က္စ", "က္ဆ", "က္ဇ", "က္ဉ", "က္ည", "က္ဍ", "က္တ", "က္ထ", "က္ဒ", "က္လ", "က္သ", "က္ဟ", "က္ၜ", "က္အ", "ကၞ", "ကၟ", "ကျ", "ကြ", "ကၠ", "ကွ", "ကှ", "ခ္ၚ", "ခ္စ", "ခ္ဆ", "ခ္ဇ", "ခ္ည", "ခ္ဍ", "ခ္ဒ", "ခ္ၜ", "ခၞ", "ခၟ", "ချ", "ခြ", "ခၠ", "ခွ", "ခှ", "ဂ္က", "ဂ္ဂ", "ဂ္ဃ", "ဂ္ၚ", "ဂ္စ", "ဂ္ဆ", "ဂ္ဇ", "ဂ္ည", "ဂ္ဍ", "ဂ္တ", "ဂ္ထ", "ဂ္ဒ", "ဂ္လ", "ဂ္ၜ", "ဂ္အ", "ဂၞ", "ဂၟ", "ဂျ", "ဂြ", "ဂၠ", "ဂွ", "ဂှ", "စ္ၚ", "စ္စ", "စ္ဆ", "စ္ည", "စ္ဍ", "စ္ၜ", "စၞ", "စၟ", "စျ", "စြ", "စၠ", "စွ", "စှ", "ဆ္ၚ", "ဆ္ည", "ဆ္ဍ", "ဆ္ၜ", "ဆၞ", "ဆၟ", "ဆျ", "ဆြ", "ဆၠ", "ဆွ", "ဆှ", "ဇ္က", "ဇ္ဂ", "ဇ္ၚ", "ဇ္ဇ", "ဇ္ၛ", "ဇ္ဉ", "ဇ္ည", "ဇ္ဍ", "ဇ္ၜ", "ဇၞ", "ဇၟ", "ဇျ", "ဇြ", "ဇၠ", "ဇွ", "ဇှ", "ဉ္စ", "ဉ္ဆ", "ဉ္ဇ", "ဉ္ၛ", "ဉှ", "ည္ည", "ညှ", "ဋ္ဋ", "ဋ္ဌ", "ဍ္ဍ", "ဍ္ဎ", "ဏ္ဋ", "ဏ္ဌ", "ဏ္ဍ", "ဏ္ဎ", "ဏ္ဏ", "ဏ္ထ", "ဏျ", "ဏှ", "တ္က", "တ္ခ", "တ္ဂ", "တ္ၚ", "တ္စ", "တ္ဆ", "တ္ဇ", "တ္ည", "တ္ဍ", "တ္တ", "တ္ထ", "တ္ပ", "တ္ဖ", "တ္ဗ", "တ္ဘ", "တ္လ", "တ္သ", "တ္ဟ", "တ္ၜ", "တ္အ", "တၞ", "တၟ", "တျ", "တြ", "တၠ", "တွ", "တှ", "ထ္က", "ထ္ခ", "ထ္ဂ", "ထ္ၚ", "ထ္စ", "ထ္ဆ", "ထ္ဇ", "ထ္ည", "ထ္ဍ", "ထ္ပ", "ထ္ဖ", "ထ္ဗ", "ထ္ဘ", "ထ္လ", "ထ္သ", "ထ္ဟ", "ထ္ၜ", "ထ္အ", "ထၞ", "ထၟ", "ထျ", "ထြ", "ထၠ", "ထွ", "ထှ", "ဒ္က", "ဒ္ခ", "ဒ္ဂ", "ဒ္ၚ", "ဒ္စ", "ဒ္ဆ", "ဒ္ဇ", "ဒ္ဉ", "ဒ္ည", "ဒ္ဍ", "ဒ္ဒ", "ဒ္ဓ", "ဒ္လ", "ဒ္သ", "ဒ္ၜ", "ဒ္အ", "ဒၞ", "ဒၟ", "ဒျ", "ဒြ", "ဒၠ", "ဒွ", "ဒှ", "ဓျ", "ဓွ", "န္တ", "န္ထ", "န္ဒ", "န္ဓ", "န္န", "နျ", "နွ", "နှ", "ပ္က", "ပ္ခ", "ပ္ဂ", "ပ္ၚ", "ပ္စ", "ပ္ဆ", "ပ္ဇ", "ပ္ည", "ပ္ဍ", "ပ္တ", "ပ္ထ", "ပ္ဒ", "ပ္ဓ", "ပ္ပ", "ပ္ဖ", "ပ္လ", "ပ္သ", "ပ္ၜ", "ပ္အ", "ပၞ", "ပၟ", "ပျ", "ပြ", "ပၠ", "ပွ", "ပှ", "ဖ္က", "ဖ္ခ", "ဖ္ဂ", "ဖ္ၚ", "ဖ္စ", "ဖ္ဆ", "ဖ္ဇ", "ဖ္ည", "ဖ္ဍ", "ဖ္တ", "ဖ္ထ", "ဖ္ဒ", "ဖ္ဓ", "ဖ္ၜ", "ဖ္အ", "ဖၞ", "ဖၟ", "ဖျ", "ဖြ", "ဖၠ", "ဖွ", "ဖှ", "ဗ္က", "ဗ္ခ", "ဗ္ဂ", "ဗ္ၚ", "ဗ္စ", "ဗ္ဆ", "ဗ္ဇ", "ဗ္ည", "ဗ္ဍ", "ဗ္တ", "ဗ္ထ", "ဗ္ဒ", "ဗ္ဓ", "ဗ္ဗ", "ဗ္ဘ", "ဗ္ၜ", "ဗ္အ", "ဗၞ", "ဗၟ", "ဗျ", "ဗြ", "ဗၠ", "ဗွ", "ဗှ", "ဘွ", "မ္က", "မ္ခ", "မ္ဂ", "မ္ၚ", "မ္စ", "မ္ဆ", "မ္ဇ", "မ္ည", "မ္ဍ", "မ္တ", "မ္ထ", "မ္ဒ", "မ္ဓ", "မ္ပ", "မ္ဖ", "မ္ဗ", "မ္ဘ", "မ္မ", "မ္သ", "မ္ၜ", "မ္အ", "မၞ", "မျ", "မြ", "မၠ", "မွ", "မှ", "ယၟ", "ယျ", "ယြ", "ယွ", "ယှ", "ရှ", "လ္က", "လ္ခ", "လ္ဂ", "လ္ၚ", "လ္စ", "လ္ဆ", "လ္ဇ", "လ္ည", "လ္တ", "လ္ထ", "လ္ဒ", "လ္ဓ", "လ္ပ", "လ္လ", "လ္မ", "လ္ဟ", "လ္ၜ", "လ္အ", "လၞ", "လၟ", "လျ", "လွ", "လှ", "ဝှ", "သ္က", "သ္ခ", "သ္ဂ", "သ္ၚ", "သ္စ", "သ္ဆ", "သ္ဇ", "သ္ည", "သ္ဍ", "သ္တ", "သ္ထ", "သ္ဒ", "သ္ဓ", "သ္န", "သ္ပ", "သ္ဘ", "သ္လ", "သ္မ", "သ္ၜ", "သ္အ", "သၞ", "သၟ", "သျ", "သြ", "သၠ", "သွ", "သှ", "ဟ္မ", "ဟွ", "ဠ္ဠ", "ဠှ", "အ္စ", "အ္ဍ", "အြ"]

monvowels = ["", "ါ", "ာ", "ိ", "ဳ", "ု", "ူ", "ေ", "ဲ", "ေါ", "ော", "ဴ", "ံ", "း", "ို", "ါံ", "ာံ", "ုံ", "ေံ", "ေါံ", "ောံ", "ီ", "ီု", "ါဲ", "ာဲ", "ုဲ", "ေဲ", "ေါဲ", "ောဲ", "ိုဲ", "ဵု"]
monfinals = ["", "က်", "င်", "တ်", "န်", "ပ်", "မ်", "ယ်", "ဝ်", "ဟ်", "အ်"]
numerals = "၀၁၂၃၄၅၆၇၈၉"

print("Every Mon consonant")
for monconsonant in monconsonants:
	print(monconsonant, end=' ')
print()
print()

print("Every Mon consonant with every vowel and final")
for monconsonant in monconsonants:
	for monvowel in monvowels:
		for monfinal in monfinals:
			print(monconsonant + monvowel + monfinal, end=' ')
	print()
print()
print()

print("Every Mon independent vowel with every final")
for monindependentvowel in monindependentvowels:
	for monfinal in monfinals:
		print(monindependentvowel + monfinal, end=' ')
	print()
print()
print()

print("Every Mon conjunct with every vowel and final")
for monconjunct in monconjuncts:
	for monvowel in monvowels:
		for monfinal in monfinals:
			print(monconjunct + monvowel + monfinal, end=' ')
	print()
print()
print()
